In [1]:
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder, OrdinalEncoder, OneHotEncoder, LabelBinarizer, MultiLabelBinarizer,MinMaxScaler, RobustScaler, StandardScaler, PolynomialFeatures, PowerTransformer
from sklearn.datasets import load_iris
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import Binarizer, KBinsDiscretizer, StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.linear_model import SGDClassifier
from sklearn.pipeline import make_pipeline
from sklearn.model_selection import GridSearchCV
from sklearn.compose import make_column_transformer, make_column_selector
from sklearn.impute import SimpleImputer, KNNImputer
import pandas as pd
import numpy as np

Bad key "text.kerning_factor" on line 4 in
C:\ProgramData\Anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test_patch.mplstyle.
You probably need to get an updated matplotlibrc file from
https://github.com/matplotlib/matplotlib/blob/v3.1.3/matplotlibrc.template
or from the matplotlib source distribution

In [2]:
dfgender = pd.read_csv(r"C:\Users\utilisateur\Documents\Mlearning\Brief_Projet_Titanic\titanic\gender_submission.csv")
test = pd.read_csv(r"C:\Users\utilisateur\Documents\Mlearning\Brief_Projet_Titanic\titanic\test.csv")
train = pd.read_csv(r"C:\Users\utilisateur\Documents\Mlearning\Brief_Projet_Titanic\titanic\train.csv")

In [3]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
train = train.drop('Cabin', axis=1)
test = test.drop('Cabin', axis=1)

In [6]:
train.shape

(891, 11)

In [7]:
train['Embarked'].fillna('S', inplace=True)
test['Embarked'].fillna('S', inplace=True)

In [8]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

In [9]:
train['Age'].fillna(15,limit=59,inplace=True)
train['Age'].fillna(30,limit=59,inplace=True)
test['Age'].fillna(15,limit=59,inplace=True)
test['Age'].fillna(30,limit=59,inplace=True)

In [10]:
train.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            59
SibSp           0
Parch           0
Ticket          0
Fare            0
Embarked        0
dtype: int64

In [11]:
train['Age'].fillna(45,inplace=True)
test['Age'].fillna(45,inplace=True)

In [12]:
train.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [13]:
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
5,6,0,3,"Moran, Mr. James",male,15.0,0,0,330877,8.4583,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,C

In [14]:
train.to_csv(r'C:\Users\utilisateur\Documents\Mlearning\Brief_Projet_Titanic\titanic\train_modifie.csv', index = False)

In [15]:
y = train['Survived']
X = train.drop(['Survived','Name','Ticket','PassengerId','SibSp','Parch','Embarked'], axis=1)

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=5)

X_train.head()

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
887       1  female  19.0      0      0  30.0000        S
416       2  female  34.0      1      1  32.5000        S
479       3  female   2.0      0      1  12.2875        S
134       2    male  25.0      0      0  13.0000        S
588       3    male  22.0      0      0   8.0500        S

In [16]:
# encoder1 = OneHotEncoder()
# X_train['Embarked'] = encoder1.fit_transform(X_train[['Embarked']] )
# X_test['Embarked'] = encoder1.fit_transform(X_test[['Embarked']] )

In [17]:
#creation transformer
# Embarked = ['Embarked']
# sexe = ['Sex']

# Embarked_pipeline = make_pipeline(OneHotEncoder())
# sexe_pipeline = make_pipeline(LabelEncoder())

# X_train = np.array(X_train)

# print(X_train)



encoder = LabelEncoder()
X_train.iloc[:,1] = encoder.fit_transform(X_train.iloc[:,1])
X_test.iloc[:,1] = encoder.fit_transform(X_test.iloc[:,1])


# X_train.iloc[:,6] = encoder.fit_transform(X_train.iloc[:,6])
# X_test.iloc[:,6] = encoder.fit_transform(X_test.iloc[:,6])

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [18]:
X_train.head()

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
887       1    0  19.0      0      0  30.0000         2
416       2    0  34.0      1      1  32.5000         2
479       3    0   2.0      0      1  12.2875         2
134       2    1  25.0      0      0  13.0000         2
588       3    1  22.0      0      0   8.0500         2

In [19]:
X_train.head()
X_test.head()

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
126       3    1  15.0      0      0   7.7500         1
354       3    1  30.0      0      0   7.2250         0
590       3    1  35.0      0      0   7.1250         2
509       3    1  26.0      0      0  56.4958         2
769       3    1  32.0      0      0   8.3625         2

In [20]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(solver='lbfgs', multi_class='auto')
# model = LogisticRegression(solver='lbfgs', multi_class='auto', penalty ='none', random_state = 0)
model.fit(X_train,y_train)
# predictions = model.predict(X_test)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [21]:
model.predict(X_test)

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1,
       1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0,
       0, 1, 0], dtype=int64)

In [22]:
model.score(X_test,y_test)

0.8156424581005587